app/views/kaisya/edit.html.erb

SELECT "genres".* FROM "genres"
SELECT 1 AS one FROM "genres" INNER JOIN "genres_shops" ON "genres"."id" = "genres_shops"."genre_id" WHERE "genres_shops"."shop_id" = 17 AND "genres"."id" = 1 LIMIT 1
---
				  <label>
			   	  <%= f.check_box :genle_ids,
			            {:checked => @shop.genres.include?(genre),
				          :name => "shop[genre_ids][]"}, genre.id,"" %>