app/views/kaisya/index.html.erb

			<span class="label label-info"><%= shop.moyori_station.stationname %></span>
			<% shop.genres.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_shops" ON "genres"."id" = "genres_shops"."genre_id" WHERE "genres_shops"."shop_id" = 14

			<% end %>
			<% shop.shops_tags.each do |shops_tag| %>
---
SELECT "shops_tags".* FROM "shops_tags" WHERE "shops_tags"."shop_id" = 14

			</tr>
			<% shop.use_rirekis.each do |use_rireki| %>
---
SELECT "use_rirekis".* FROM "use_rirekis" WHERE "use_rirekis"."shop_id" = 15

			<% end %>
			<span>&nbsp;&nbsp;&nbsp;&nbsp;[
				<% if  shop.kuchikomis.length != 0 then %>
					<a href="javascript:void(0)" class="kuchiopen<%= count %>">口コミ&nbsp;<%= shop.kuchikomis.length  %>件&nbsp;を<span>開く　▼</span></a>
				<% else %>
					口コミ&nbsp;0件
				<% end %>
				]&nbsp;&nbsp;
---
SELECT "kuchikomis".* FROM "kuchikomis" WHERE "kuchikomis"."shop_id" = 15