app/views/kaisya/new.html.erb

SELECT "genres".id FROM "genres" INNER JOIN "genres_shops" ON "genres"."id" = "genres_shops"."genre_id" WHERE "genres_shops"."shop_id" IS NULL
SELECT 1 AS one FROM "genres" INNER JOIN "genres_shops" ON "genres"."id" = "genres_shops"."genre_id" WHERE "genres_shops"."shop_id" IS NULL AND "genres"."id" = 1 LIMIT 1
---
						<label>
							<%= f.check_box :genle_ids,
					   		{:checked => @shop.genres.include?(genre),
							 :name => "shop[genre_ids][]"}, genre.id,""	%>