app/views/osusumes/index.html.erb

            <span class="label label-info"><%= osusume.moyori_station.stationname %></span>
            <% osusume.genres.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_osusumes" ON "genres"."id" = "genres_osusumes"."genre_id" WHERE "genres_osusumes"."osusume_id" = 11

            <% end %>
            <% osusume.osusumes_tags.each do |osusumes_tag| %>
---
SELECT "osusumes_tags".* FROM "osusumes_tags" WHERE "osusumes_tags"."osusume_id" = 12

			<p>
			<span>&nbsp;&nbsp;&nbsp;&nbsp;[
                 <% if  osusume.tsubuyakis.length != 0 then %>
                     <a href="javascript:void(0)" class="kuchiopen<%= count %>">つぶやき&nbsp;<%= osusume.tsubuyakis.length  %>件&nbsp;を<span>開く　▼</span></a>
                 <% else %>
                     つぶやき&nbsp;0件
                 <% end %>
                 ]&nbsp;&nbsp;
---
SELECT "tsubuyakis".* FROM "tsubuyakis" WHERE "tsubuyakis"."osusume_id" = 12