app/views/osusumes/new.html.erb

SELECT "genres".* FROM "genres"
SELECT 1 AS one FROM "genres" INNER JOIN "genres_osusumes" ON "genres"."id" = "genres_osusumes"."genre_id" WHERE "genres_osusumes"."osusume_id" IS NULL AND "genres"."id" = 1 LIMIT 1
---
				        <label>
					   <%= f.check_box :genre_ids,
				           {:checked => @osusume.genres.include?(genre),
				            :name => "osusume[genre_ids][]"}, genre.id,"" %>